class Provider < ActiveRecord::Base
  validates_presence_of :name,:addr,:contact,:phone
  validate :phone_validation

  protected

  def phone_validation
    #在做项目时常常用到判断电话号码的正则表达式，写了一个，可验证如下27种格式：
    #
    #110
    #8888888
    #88888888
    #8888888-123
    #88888888-23435
    #0871-8888888-123
    #023-88888888-23435
    #86-0871-8888888-123
    #8888888_123
    #88888888_23435
    #0871_8888888_123
    #023_88888888_23435
    #86_0871_8888888_123
    #8888888－123
    #88888888－23435
    #0871－8888888－123
    #023－88888888－23435
    #86－0871－8888888－123
    #8888888—123
    #88888888—23435
    #0871—8888888—123
    #023—88888888—23435
    #86—0871—8888888—123
    #13588888888
    #15988888888
    #013588888888
    #015988888888
    #
    #分格时，用户可以输入中英文的-－—
    #
    #正则表达式如下：
    errors.add(:phone,"电话号码有误！") unless phone=~/(^(\d{2,4}[-－—]?)?\d{3,8}([-－—]?\d{3,8})?([-－—]?\d{1,7})?$)|(^0?1[35]\d{9}$)/
    #正则表达式有点地方不明白，为什么18909711234也可以匹配到？
  end
end
